#+TITLE: EVM Bridge Rework
#+DATE: <2023-06-05 Mon>
#+STARTUP: inlineimages

* Admininstration
#+NAME: github-repo-owner
#+BEGIN_SRC elisp :cache yes
  "eosnetworkfoundation"
#+END_SRC

#+RESULTS[1fec5217a12a490ec14bb0010770609ad0740732]: github-repo-owner
: eosnetworkfoundation

#+NAME: github-repo-name
#+BEGIN_SRC elisp :cache yes
  "frontend-engineering"
#+END_SRC

#+RESULTS[a02dee89949b8d3ce89ce69e72df9b912125da9e]: github-repo-name
: frontend-engineering

#+NAME: github-access-token
#+BEGIN_SRC elisp :cache yes
  (with-temp-buffer
    (insert-file-contents "./classic-token.txt")
    (s-trim (buffer-string)))
#+END_SRC

#+RESULTS[c1acbb6ee50477f8c02baecfa39dbdb838192c6b]: github-access-token
: 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

#+NAME: get-repo-issues
#+BEGIN_SRC http :noweb yes :results value code :pretty
  GET https://api.github.com/repos/<<github-repo-owner()>>/<<github-repo-name()>>/issues
  Content-Type: application/json
  Accept: application/vnd.github+json
  X-GitHub-Api-Version: 2022-11-28
  Authorization: Bearer <<github-access-token()>>
#+END_SRC

#+NAME: issues
#+BEGIN_SRC elisp :cache yes
(json-encode '(("issues" . ((("title" . "Test Issue") ("body" . "I'm having a problem with this.") ("milestone" . 4))))))
#+END_SRC

#+RESULTS[692460ff1f0d436fec1b3aaae0f6b827f74c449c]: issues
: {"issues":[{"title":"Test Issue","body":"I'm having a problem with this.","milestone":4}]}

#+NAME: create-repo-issues
#+BEGIN_SRC http :noweb yes
  POST https://api.github.com/repos/<<github-repo-owner()>>/<<github-repo-name()>>/issues
  Accept: application/vnd.github+json
  X-GitHub-Api-Version: 2022-11-28
  Authorization: Bearer <<github-access-token()>>

  <<issues()>>
#+END_SRC

